W4_D2_Address_Book/app/controllers/contact_controller.rb

  def index
    @contacts = Contact.order(name: :asc)
---
SELECT "contacts".* FROM "contacts"  ORDER BY "contacts"."name" DESC

  def create
    contact = Contact.new(
      :name => params[:contact][:name],
      :address => params[:contact][:address],
      :phone_number => params[:contact][:phone],
      :email_address => params[:contact][:email])

    if contact.check_name(contact)!= nil && contact.check_address(contact) != nil
      contact.save
---
INSERT INTO "contacts" ("name", "address", "phone_number", "email_address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def show
    # @contact = Contact.find(params[:id])
    id = params[:id]
    @selected_contact = Contact.find_by(id: id)
---
SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = ? LIMIT 1  [["id", nil]]

  def favorite
    id = params[:id]
    @selected_contact = Contact.find_by(id: id)
    # :favourite => params[:favourite])
    # if params[:value] == "true"
    #   value = true
    # elsif params[:value] == "false"
    #   value = false
    # end

    @selected_contact.update_attribute(:favourite, true)
---
SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = ? LIMIT 1  [["id", 0]]
UPDATE "contacts" SET "favourite" = ?, "updated_at" = ? WHERE "contacts"."id" = ?  [["favourite", "t"], ["updated_at", "2016-04-26 15:43:15.121579"], ["id", 5]]